Revit 2024 API
Zone.HeatingAirTemperature Property
Get or set the Heating Air Temperature of the Zone.
Namespace: Autodesk.Revit.DB.Mechanical
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public double HeatingAirTemperature { get; set; }
Visual Basic
Public Property HeatingAirTemperature As Double
	Get
	Set
Visual C++
public:
property double HeatingAirTemperature {
	double get ();
	void set (double value);
}
Remarks
This property is used to get or set the Heating Air Temperature of the Zone.
See Also
Zone Class
Autodesk.Revit.DB.Mechanical Namespace